In [23]:
import pandas as pd

In [24]:
data = [['Juan',20],['Pedro',30]]

df = pd.DataFrame(data, columns=['Nombre','Edad'])
df

  Nombre  Edad
0   Juan    20
1  Pedro    30

In [25]:
#Dataframe a partir de diccionarios

data = {
    "nombre": ["Juan","Pedro"],
    "edad": [20,30]
}
df = pd.DataFrame(data)
df

  nombre  edad
0   Juan    20
1  Pedro    30

In [26]:
#tuplas
data = [['Juan',20],['Pedro',30]]
df = pd.DataFrame(data)
df

       0   1
0   Juan  20
1  Pedro  30

In [27]:
df = pd.read_csv("./data/data.csv")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [28]:
df = pd.read_csv("./data/data")
df

   nombre|edad|ciudad
0        Juan||Madrid
1  María|30|Barcelona
2    Pedro|35|Sevilla

In [29]:
df = pd.read_csv("./data/data",sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [30]:
df = pd.read_csv("./data/data_without_header")
df

    Juan  25     Madrid
0  María  30  Barcelona
1  Pedro  35    Sevilla

In [31]:
df = pd.read_csv("./data/data_without_header",header=None)
df

       0   1          2
0   Juan  25     Madrid
1  María  30  Barcelona
2  Pedro  35    Sevilla

In [32]:
df = pd.read_csv("./data/data_without_header",header=None, names=["nombre","edad","ciudad"])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [33]:
df = pd.read_json("./data/data.json")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [34]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [35]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [36]:
df.columns[0:1]

Index(['nombre'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [38]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [39]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [40]:
df[['ciudad','edad']]

      ciudad  edad
0     Madrid    25
1  Barcelona    30
2    Sevilla    35

In [41]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [42]:
df.loc[[0,1]]

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [43]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [44]:
df.groupby('grupo').mean()

KeyError: 'grupo'

In [ ]:
df.groupby('grupo').sum()

In [47]:
dict1={
    'A':['A0','A1','A2'],
    'clave1':['K0','K1','K2']
}
df1=pd.DataFrame(dict1)

dict2={
    'B':['B0','B1'],
    'clave2':['K0','K3']
}

df2=pd.DataFrame(dict2)

df1
df2

    B clave2
0  B0     K0
1  B1     K3

In [48]:
#pd.merge(df1,df2,on='clave')#con misma clave
pd.merge(df1,df2,left_on='clave1',right_on='clave2')#con otra clave

    A clave1   B clave2
0  A0     K0  B0     K0

In [50]:
data1 = {
    "grupo": ["A","B","A","B"],
    "valor": [10,20,30,15]
}
df = pd.DataFrame(data1)
df

  grupo  valor
0     A     10
1     B     20
2     A     30
3     B     15

In [ ]:
df["doble_valor"]=df[]